#### Pandas-DataFrame And Series
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [3]:
import pandas as pd

In [4]:
## Series
##A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
## Create a Series from dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [5]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [13]:
## Dataframe
## create a Dataframe from a dictionary of list

data={
    'Name':['Khan','John','Jack'],
    'Age':[20,30,45],
    'City':['Bangalore','New York','Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

   Name  Age       City
0  Khan   20  Bangalore
1  John   30   New York
2  Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [11]:
## Create a Data frame From a List of Dictionaries

data=[
    {'Name':'Khan','Age':20,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Bappy','Age':32,'City':'Bangalore'},
    {'Name':'JAck','Age':32,'City':'Bangalore'}
    
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0   Khan   20  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [18]:
pd.read_csv('sales_data.csv').head()

         Date Category  Value   Product  Sales Region
0  01-01-2023        A   28.0  Product1  754.0   East
1  02-01-2023        B   39.0  Product3  110.0  North
2  03-01-2023        C   32.0  Product2  398.0   East
3  04-01-2023        B    8.0  Product1  522.0   East
4  05-01-2023        B   26.0  Product3  869.0  North

In [20]:
pd.read_csv('sales_data.csv').tail()

          Date Category  Value   Product  Sales Region
45  15-02-2023        B   99.0  Product2  599.0   West
46  16-02-2023        B    6.0  Product1  938.0  South
47  17-02-2023        B   69.0  Product3  143.0   West
48  18-02-2023        C   65.0  Product3  182.0  North
49  19-02-2023        C   11.0  Product3  708.0  North

In [21]:
df

   Name  Age       City
0  Khan   20  Bangalore
1  John   30   New York
2  Jack   45    Florida

In [23]:
df['Name']

0    Khan
1    John
2    Jack
Name: Name, dtype: object

In [24]:
df['Age']

0    20
1    30
2    45
Name: Age, dtype: int64

In [25]:
df.iloc[0]

Name         Khan
Age            20
City    Bangalore
Name: 0, dtype: object

In [26]:
## Accessing a specified element
df.at[2,'Age']

np.int64(45)

In [27]:
## Accessing a specified element using iat
df.iat[2,2]

'Florida'

In [28]:
### Data MAnipulation with Dataframe
df

   Name  Age       City
0  Khan   20  Bangalore
1  John   30   New York
2  Jack   45    Florida

In [29]:
## Adding a column
df['Salary']=[50000,60000,70000]
df

   Name  Age       City  Salary
0  Khan   20  Bangalore   50000
1  John   30   New York   60000
2  Jack   45    Florida   70000

In [30]:
df=pd.read_csv('sales_data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  01-01-2023        A   28.0  Product1  754.0   East
1  02-01-2023        B   39.0  Product3  110.0  North
2  03-01-2023        C   32.0  Product2  398.0   East
3  04-01-2023        B    8.0  Product1  522.0   East
4  05-01-2023        B   26.0  Product3  869.0  North

In [31]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Data types:
 Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object
Statistical summary:
            Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [32]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000